In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM film', engine)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [4]:
data = pd.read_sql_query ("select distinct last_name from actor", engine)
data

       last_name
0         AKROYD
1          ALLEN
2        ASTAIRE
3         BACALL
4         BAILEY
..           ...
116      WINSLET
117  WITHERSPOON
118         WOOD
119         WRAY
120    ZELLWEGER

[121 rows x 1 columns]

In [5]:
query = """SELECT rental_date,
CASE \
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sat' then 'weekend'\
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sun' then 'weekend'\
ELSE 'weekday'\
END AS column_day_type \
FROM rental"""
data = pd.read_sql_query(query, engine)

data

              rental_date column_day_type
0     2005-05-24 22:53:30         weekday
1     2005-05-24 22:54:33         weekday
2     2005-05-24 23:03:39         weekday
3     2005-05-24 23:04:41         weekday
4     2005-05-24 23:05:21         weekday
...                   ...             ...
16039 2006-02-14 15:16:03         weekday
16040 2006-02-14 15:16:03         weekday
16041 2006-02-14 15:16:03         weekday
16042 2006-02-14 15:16:03         weekday
16043 2006-02-14 15:16:03         weekday

[16044 rows x 2 columns]

In [6]:
query ='''SELECT * FROM film WHERE title LIKE "%%ARMAGEDDON%%"'''
data = pd.read_sql_query(query, engine)
data

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
5,844,STEERS ARMAGEDDON,A Stunning Character Study of a Car And a Girl...,2006,1,None,6,4.99,140,16.99,PG,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42

In [7]:
query = '''SELECT title, length FROM film ORDER BY length DESC LIMIT 10'''

data = pd.read_sql_query (query,engine)
data

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [8]:
query ='''SELECT count(*) FROM film WHERE title LIKE "%%behind_the_scenes%%"'''
data = pd.read_sql_query(query, engine)
data

   count(*)
0         0

In [9]:
query ='''SELECT rental_rate, AVG(length) as"average_duration" 
FROM film 
GROUP BY rental_rate 
HAVING AVG(length)>120'''
data = pd.read_sql_query(query, engine)
data

Empty DataFrame
Columns: [rental_rate, average_duration]
Index: []

In [10]:
query ='''SELECT title, length, RANK () OVER (ORDER BY length DESC) as "ranks"
FROM film
WHERE length IS NOT NULL AND length !="0"'''
data = pd.read_sql_query(query, engine)
data

                   title  length  ranks
0          CHICAGO NORTH     185      1
1         CONTROL ANTHEM     185      1
2         DARN FORRESTER     185      1
3            GANGS PRIDE     185      1
4              HOME PITY     185      1
..                   ...     ...    ...
995         ALIEN CENTER      46    996
996            IRON MOON      46    996
997        KWAI HOMEWARD      46    996
998     LABYRINTH LEAGUE      46    996
999  RIDGEMONT SUBMARINE      46    996

[1000 rows x 3 columns]